# 1.
if choice.lower() == 'д':
    # ваш код здесь

# 2.
count_spaces = 0
for char in mystring:
    if char == ' ':
        count_spaces += 1

# 3.
count_digits = 0
for char in mystring:
    if char.isdigit():
        count_digits += 1

# 4.
count_lower = 0
for char in mystring:
    if char.islower():
        count_lower += 1

# 5.
def ends_with_sot(string):
    return string.endswith('. сот')

# 6.
new_string = mystring.replace('т', 'Т')

# 7.
def reverse_string(string):
    return string[::-1]

# 8.
first_three = mystring[:3]

# 9.
last_three = mystring[-3:]

# 10.
mystring = 'пирожки>молоко>стряпня>яблочный пирог>мороженое'
my_list = mystring.split('>')
my_list[-2] = my_list[-2].replace(' ', ': ')


# 4. Конвертер азбуки Морзе.
def text_to_morse(text):
    morse_code = {
        ' ': ' ', ',': '--..--', '.': '.-.-.-', '?': '..--..',
        '0': '-----', '1': '.----', '2': '..---', '3': '...--',
        '4': '....-', '5': '.....', '6': '-....', '7': '--...',
        '8': '---..', '9': '----.', 'A': '.-', 'Б': '-...',
        'В': '.--', 'Г': '--.', 'Д': '-..', 'Е': '.', 'Ё': '.',
        'Ж': '...-', 'З': '--..', 'И': '..', 'Й': '.---', 'К': '-.-',
        'Л': '.-..', 'М': '--', 'Н': '-.', 'О': '---', 'П': '.--.',
        'Р': '.-.', 'С': '...', 'Т': '-', 'У': '..-', 'Ф': '..-.',
        'Х': '....', 'Ц': '-.-.', 'Ч': '---.', 'Ш': '----', 'Щ': '--.-',
        'Ъ': '--.--', 'Ы': '-.--', 'Ь': '-..-', 'Э': '..-..', 'Ю': '..--',
        'Я': '.-.-', 'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.',
        'д': '-..', 'е': '.', 'ё': '.', 'ж': '...-', 'з': '--..',
        'и': '..', 'й': '.---', 'к': '-.-', 'л': '.-..', 'м': '--',
        'н': '-.', 'о': '---', 'п': '.--.', 'р': '.-.', 'с': '...',
        'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.',
        'ч': '---.', 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--',
        'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-'
    }
    morse_text = ''
    for char in text:
        if char in morse_code:
            morse_text += morse_code[char] + ' '
    return morse_text.strip()

user_input = input("Введите строку: ")
print("Кодировка азбуки Морзе:", text_to_morse(user_input))
